{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "name": "convolution2d_1", "batch_input_shape": [null, 64, 64, 1], "activity_regularizer": null, "activation": "relu", "W_constraint": null, "W_regularizer": null, "border_mode": "same", "nb_col": 5, "trainable": true, "dim_ordering": "tf", "bias": true, "nb_filter": 8}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "same", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 8192, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 50, "name": "dense_1", "b_constraint": null, "activation": "relu", "W_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 2, "name": "dense_2", "b_constraint": null, "activation": "softmax", "W_constraint": null, "W_regularizer": null, "bias": true}}]}